---
kind: type
id: T:Autodesk.Revit.DB.Events.ExternalDataTypeServerFailureResolutionExecutingEventArgs
source: html/81d0c125-52cf-a81c-5c2a-f02fac4f9da0.htm
---
# Autodesk.Revit.DB.Events.ExternalDataTypeServerFailureResolutionExecutingEventArgs

The event arguments used by the ExternalDataTypeServerFailureResolutionExecuting event.

## Syntax (C#)
```csharp
public class ExternalDataTypeServerFailureResolutionExecutingEventArgs : RevitAPIPreDocEventArgs
```